using Persistence.DataModels;

namespace Persistence.SeedingData;

internal static class SeedVehicles
{
    public static List<VehicleDataModel> GetVehicles(
        List<VehicleTypeDataModel> types,
        List<VehicleColorDataModel> colors,
        List<VehicleBrandDataModel> brands,
        List<VehicleModelDataModel> models) =>
    [
        // 0
        new VehicleDataModel(
            brandId: brands[0].Id,
            modelId: models.Where(x => x.VehicleBrandId == brands[0].Id).ToList()[0].Id,
            typeId: types.First(x => x.Name.Equals("Седан")).Id,
            colorId: colors.First(x => x.Name.Equals("Чорний")).Id,
            displacement: 2.5d,
            price: 30000,
            description: "Марка та модель: Toyota Camry 2022\n" +
                         "Класифікація: Седан\n" +
                         "Двигун:\n" +
                         "   - Тип: Бензиновий\n" +
                         "   - Об'єм: 2.5 літра\n" +
                         "   - Потужність: 203 к.с. / 206 к.с. (залежно від комплектації)\n" +
                         "Трансмісія:\n" +
                         "   - Автоматична\n" +
                         "   - Кількість передач: 8-ступінчаста\n" +
                         "Привід: Передній / Задній\n" +
                         "Витрата пального:\n" +
                         "   - Місто: 8.1 л/100 км\n" +
                         "   - Автострада: 5.7 л/100 км\n" +
                         "Дизайн і екстер'єр:\n" +
                         "   - Сучасний і елегантний дизайн\n" +
                         "   - Лінії кузова, що надають динамічний вигляд\n" +
                         "   - Стильні LED фари та задні світла\n" +
                         "Інтер'єр:\n" +
                         "   - Просторий та комфортний салон\n" +
                         "   - Високоякісні матеріали відделки\n" +
                         "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                         "   - Комфортні сидіння з підтримкою поясничної частини\n" +
                         "Технології та безпека:\n" +
                         "   - Toyota Safety Sense 2.5+: Система активної безпеки, яка включає в себе систему автоматичного екстреного гальмування, контроль полоси руху, адаптивний круїз-контроль та інші функції.\n" +
                         "   - Система розпізнавання дорожніх знаків\n" +
                         "   - Система допомоги при паркуванні\n" +
                         "   - Інтегрована система звукового та навігаційного обладнання\n" +
                         "Ємність багажника: Приблизно 15.1 кубічних футів\n" +
                         "Вартість (за орієнтованою конфігурацією): Від $25,000 до $35,000 (в залежності від обраної комплектації та додаткових опцій)\n"
        ),
        // 1
        new VehicleDataModel(
        brandId: brands[1].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[1].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Пікап")).Id,
        colorId: colors.First(x => x.Name.Equals("Білий")).Id,
        displacement: 2.9d,
        price: 45000,
        description: "Марка та модель: Ford F-150\n" +
                     "Класифікація: Пікап\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 2.7 літра до 5.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 290 к.с. до 450 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 10-ступінчаста\n" +
                     "Привід: Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 12.0 л/100 км до 15.7 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 9.1 л/100 км до 12.4 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Міцний та агресивний вигляд\n" +
                     "   - Великий вантажний простір у задній частині\n" +
                     "   - Сучасні LED фари та задні світла\n" +
                     "Інтер'єр:\n" +
                     "   - Просторий та функціональний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Комфортні сидіння та великий вибір опцій\n" +
                     "Технології та безпека:\n" +
                     "   - Система Ford Co-Pilot360 з функціями, такими як система попередження про зіткнення, адаптивний круїз-контроль та інші\n" +
                     "   - Система розпізнавання пішоходів та інших об'єктів\n" +
                     "   - Камера заднього виду та система автоматичного паркування\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $30,000 до $70,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        // 2
        new VehicleDataModel(
        brandId: brands[2].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[2].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Купе")).Id,
        colorId: colors.First(x => x.Name.Equals("Жовтий")).Id,
        displacement: 2.0d,
        price: 28000,
        description: "Марка та модель: Honda Civic 2019\n" +
                     "Класифікація: Седан / Купе / Хетчбек\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий\n" +
                     "   - Об'єм: Від 2.0 літра до 1.5 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 158 к.с. до 306 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Варіатор\n" +
                     "   - Кількість передач: 6-ступінчаста / CVT\n" +
                     "Привід: Передній / Задній\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 7.0 л/100 км до 8.5 л/100 км (залежно від обраного двигуна та трансмісії)\n" +
                     "   - Автострада: Від 5.5 л/100 км до 6.3 л/100 км (залежно від обраного двигуна та трансмісії)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та елегантний дизайн\n" +
                     "   - Лінії кузова, що надають спортивний вигляд\n" +
                     "   - Динамічні LED фари та стильні задні світла\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Комфортні сидіння та ергономічне оздоблення салону\n" +
                     "Технології та безпека:\n" +
                     "   - Honda Sensing®: Система активних систем безпеки, включаючи систему автоматичного екстреного гальмування, контроль полоси руху та інші функції\n" +
                     "   - Система відслідковування сліпих зон та керування круїз-контролем\n" +
                     "   - Інтегрована система звукового та навігаційного обладнання\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $20,000 до $28,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        // 3
        new VehicleDataModel(
        brandId: brands[3].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[3].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Пікап")).Id,
        colorId: colors.First(x => x.Name.Equals("Синій")).Id,
        price: 55000,
        displacement: 6.2d,
        description: "Марка та модель: Chevrolet Silverado\n" +
                     "Класифікація: Пікап\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 4.3 літра до 6.2 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 285 к.с. до 420 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 6-ступінчаста / 8-ступінчаста\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 14.1 л/100 км до 16.4 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 10.6 л/100 км до 13.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Масивний та робустний вигляд\n" +
                     "   - Великий вантажний простір у задній частині\n" +
                     "   - Сучасні LED фари та виразні лінії кузова\n" +
                     "Інтер'єр:\n" +
                     "   - Функціональний та комфортний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Просторі сидіння та великий вибір опцій\n" +
                     "Технології та безпека:\n" +
                     "   - Система попередження про зіткнення та автоматичного гальмування\n" +
                     "   - Система контролю сліпих зон та камера заднього виду\n" +
                     "   - Інтегрована система звукового та навігаційного обладнання\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $30,000 до $60,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        // 4 
        new VehicleDataModel(
        brandId: brands[3].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[3].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Пікап")).Id,
        colorId: colors.First(x => x.Name.Equals("Білий")).Id,
        price: 46000,
        displacement: 5.0d,
        description: "Марка та модель: Chevrolet Silverado\n" +
                     "Класифікація: Пікап\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 4.3 літра до 6.2 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 285 к.с. до 420 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 6-ступінчаста / 8-ступінчаста\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 14.1 л/100 км до 16.4 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 10.6 л/100 км до 13.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Масивний та робустний вигляд\n" +
                     "   - Великий вантажний простір у задній частині\n" +
                     "   - Сучасні LED фари та виразні лінії кузова\n" +
                     "Інтер'єр:\n" +
                     "   - Функціональний та комфортний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Просторі сидіння та великий вибір опцій\n" +
                     "Технології та безпека:\n" +
                     "   - Система попередження про зіткнення та автоматичного гальмування\n" +
                     "   - Система контролю сліпих зон та камера заднього виду\n" +
                     "   - Інтегрована система звукового та навігаційного обладнання\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $30,000 до $60,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        // 5
        new VehicleDataModel(
        brandId: brands[4].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[4].Id).ToList()[1].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Чорний")).Id,
        price: 27000,
        displacement: 2.0d,
        description: "Марка та модель: Volkswagen Passat\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 1.5 літра до 2.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 150 к.с. до 272 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 6-ступінчастої до 7-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.0 л/100 км до 9.2 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.4 л/100 км до 7.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та стильний дизайн\n" +
                     "   - Пропорції, що надають елегантний вигляд\n" +
                     "   - Сучасні LED фари та великі колісні диски\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Комфортні сидіння та просторий салон\n" +
                     "Технології та безпека:\n" +
                     "   - Система автоматичного екстреного гальмування\n" +
                     "   - Адаптивний круїз-контроль та система розпізнавання дорожніх знаків\n" +
                     "   - Система відслідковування сліпих зон та камера заднього виду\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $25,000 до $40,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        // 6
        new VehicleDataModel(
        brandId: brands[4].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[4].Id).ToList()[1].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Сірий")).Id,
        price: 29000,
        displacement: 2.0d,
        description: "Марка та модель: Volkswagen Passat\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 1.5 літра до 2.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 150 к.с. до 272 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 6-ступінчастої до 7-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.0 л/100 км до 9.2 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.4 л/100 км до 7.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та стильний дизайн\n" +
                     "   - Пропорції, що надають елегантний вигляд\n" +
                     "   - Сучасні LED фари та великі колісні диски\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Комфортні сидіння та просторий салон\n" +
                     "Технології та безпека:\n" +
                     "   - Система автоматичного екстреного гальмування\n" +
                     "   - Адаптивний круїз-контроль та система розпізнавання дорожніх знаків\n" +
                     "   - Система відслідковування сліпих зон та камера заднього виду\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $25,000 до $40,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[5].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[5].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Червоний")).Id,
        price: 31000,
        displacement: 2.4d,
        description: "Марка та модель: Nissan Altima\n" +
                     "Класифікація: Седан\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий\n" +
                     "   - Об'єм: Від 2.0 літра до 2.5 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 188 к.с. до 248 к.с. (залежно від обраного двигуна)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: Від 8-ступінчастої до 10-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 7.4 л/100 км до 9.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 5.3 л/100 км до 7.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та стильний дизайн\n" +
                     "   - Елегантні лінії кузова та виразні фари\n" +
                     "   - Динамічний профіль та стильні задні світла\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном\n" +
                     "   - Просторі сидіння та інтелектуальне керування кліматом\n" +
                     "Технології та безпека:\n" +
                     "   - Nissan Safety Shield® 360: Набір технологій безпеки, включаючи систему автоматичного екстреного гальмування, систему контролю сліпих зон та інші\n" +
                     "   - Система розпізнавання дорожніх знаків та камера 360 градусів\n" +
                     "   - Адаптивний круїз-контроль та система утримання смуги\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $24,000 до $35,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[6].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[6].Id).ToList()[7].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Білий")).Id,
        price: 75000,
        displacement: 3.0d,
        description: "Марка та модель: BMW M3\n" +
                     "Класифікація: Седан\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий\n" +
                     "   - Об'єм: 3.0 літра\n" +
                     "   - Потужність: Від 473 к.с. (стандартна версія) до 503 к.с. (версія Competition)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 8-ступінчаста\n" +
                     "Привід: Задній / Повний (залежно від версії)\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Приблизно 14 л/100 км\n" +
                     "   - Автострада: Приблизно 9 л/100 км\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Агресивний та спортивний дизайн\n" +
                     "   - Характерні M-лінії та елементи\n" +
                     "   - LED фари та великі вихлопні труби\n" +
                     "Інтер'єр:\n" +
                     "   - Високоякісні матеріали та дизайн\n" +
                     "   - Шпильки M Sport у кабіні\n" +
                     "   - Інфотейнмент-система iDrive з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "Технології та безпека:\n" +
                     "   - Повний набір передових технологій безпеки\n" +
                     "   - Система інтелектуального круїз-контролю та система розпізнавання пішоходів\n" +
                     "   - Система динамічної стабілізації та селективна система тормозів\n" +
                     "Прискорення 0-100 км/год:\n" +
                     "   - Від 4.1 секунди (стандартна версія) до 3.9 секунди (версія Competition)\n" +
                     "Максимальна швидкість:\n" +
                     "   - Приблизно 250 км/год (електронно обмежена)\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $70,000 до $80,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[7].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[7].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Чорний")).Id,
        price: 58000,
        displacement: 3.2d,
        description: "Марка та модель: Mercedes-Benz C-Class\n" +
                     "Класифікація: Седан / Універсал / Купе / Кабріолет\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний / Плагін-гібрид\n" +
                     "   - Об'єм: Від 1.5 літра до 4.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 170 к.с. до 503 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 9-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 12.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 8.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та розкішний стиль\n" +
                     "   - Ефектні лінії кузова та великі колісні диски\n" +
                     "   - Інноваційні LED фари та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки та розкішні деталі\n" +
                     "   - Ергономічне оздоблення салону та сучасний дизайн\n" +
                     "   - Комфортні сидіння з електрорегулюванням та функцією пам'яті\n" +
                     "Технології та безпека:\n" +
                     "   - COMAND infotainment система з сенсорним екраном та навігаційною системою\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Пакет безпеки PRE-SAFE® та система розпізнавання дорожніх знаків\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $42,000 до $80,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[7].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[7].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Кабріолет")).Id,
        colorId: colors.First(x => x.Name.Equals("Чорний")).Id,
        price: 78000,
        displacement: 4.0d,
        description: "Марка та модель: Mercedes-Benz C-Class\n" +
                     "Класифікація: Седан / Універсал / Купе / Кабріолет\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний / Плагін-гібрид\n" +
                     "   - Об'єм: Від 1.5 літра до 4.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 170 к.с. до 503 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 9-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 12.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 8.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та розкішний стиль\n" +
                     "   - Ефектні лінії кузова та великі колісні диски\n" +
                     "   - Інноваційні LED фари та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки та розкішні деталі\n" +
                     "   - Ергономічне оздоблення салону та сучасний дизайн\n" +
                     "   - Комфортні сидіння з електрорегулюванням та функцією пам'яті\n" +
                     "Технології та безпека:\n" +
                     "   - COMAND infotainment система з сенсорним екраном та навігаційною системою\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Пакет безпеки PRE-SAFE® та система розпізнавання дорожніх знаків\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $42,000 до $80,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[7].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[7].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Сріблястий")).Id,
        price: 46000,
        displacement: 1.5d,
        description: "Марка та модель: Mercedes-Benz C-Class\n" +
                     "Класифікація: Седан / Універсал / Купе / Кабріолет\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний / Плагін-гібрид\n" +
                     "   - Об'єм: Від 1.5 літра до 4.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 170 к.с. до 503 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 9-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 12.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 8.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та розкішний стиль\n" +
                     "   - Ефектні лінії кузова та великі колісні диски\n" +
                     "   - Інноваційні LED фари та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки та розкішні деталі\n" +
                     "   - Ергономічне оздоблення салону та сучасний дизайн\n" +
                     "   - Комфортні сидіння з електрорегулюванням та функцією пам'яті\n" +
                     "Технології та безпека:\n" +
                     "   - COMAND infotainment система з сенсорним екраном та навігаційною системою\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Пакет безпеки PRE-SAFE® та система розпізнавання дорожніх знаків\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $42,000 до $80,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[7].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[7].Id).ToList()[0].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Синій")).Id,
        price: 80000,
        displacement: 4.0d,
        description: "Марка та модель: Mercedes-Benz C-Class\n" +
                     "Класифікація: Седан / Універсал / Купе / Кабріолет\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний / Плагін-гібрид\n" +
                     "   - Об'єм: Від 1.5 літра до 4.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 170 к.с. до 503 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична / Механічна / Роботизована\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 9-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 12.0 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 8.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Класичний та розкішний стиль\n" +
                     "   - Ефектні лінії кузова та великі колісні диски\n" +
                     "   - Інноваційні LED фари та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Якісні матеріали відделки та розкішні деталі\n" +
                     "   - Ергономічне оздоблення салону та сучасний дизайн\n" +
                     "   - Комфортні сидіння з електрорегулюванням та функцією пам'яті\n" +
                     "Технології та безпека:\n" +
                     "   - COMAND infotainment система з сенсорним екраном та навігаційною системою\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Пакет безпеки PRE-SAFE® та система розпізнавання дорожніх знаків\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $42,000 до $80,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[8].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[8].Id).ToList()[2].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Індиґо")).Id,
        price: 64000,
        displacement: 2.5d,
        description: "Марка та модель: Audi A6\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 2.0 літра до 3.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 201 к.с. до 335 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 8-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 11.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 7.8 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та елегантний стиль\n" +
                     "   - Чіткі лінії кузова та виразні LED фари\n" +
                     "   - Характерна решітка радіатора та динамічний профіль\n" +
                     "Інтер'єр:\n" +
                     "   - Високоякісні матеріали та деталі оздоблення\n" +
                     "   - Інноваційна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Комфортні сидіння з функцією обігріву та вентиляції\n" +
                     "Технології та безпека:\n" +
                     "   - Audi Virtual Cockpit та система навігації MMI Navigation Plus\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Система безпеки Audi Pre Sense та система розпізнавання пішоходів\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $55,000 до $75,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[8].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[8].Id).ToList()[2].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Білий")).Id,
        price: 57000,
        displacement: 2.0,
        description: "Марка та модель: Audi A6\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 2.0 літра до 3.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 201 к.с. до 335 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 8-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 11.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 7.8 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та елегантний стиль\n" +
                     "   - Чіткі лінії кузова та виразні LED фари\n" +
                     "   - Характерна решітка радіатора та динамічний профіль\n" +
                     "Інтер'єр:\n" +
                     "   - Високоякісні матеріали та деталі оздоблення\n" +
                     "   - Інноваційна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Комфортні сидіння з функцією обігріву та вентиляції\n" +
                     "Технології та безпека:\n" +
                     "   - Audi Virtual Cockpit та система навігації MMI Navigation Plus\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Система безпеки Audi Pre Sense та система розпізнавання пішоходів\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $55,000 до $75,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[8].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[8].Id).ToList()[2].Id,
        typeId: types.First(x => x.Name.Equals("Універсал")).Id,
        colorId: colors.First(x => x.Name.Equals("Червоний")).Id,
        price: 70000,
        displacement: 3.0d,
        description: "Марка та модель: Audi A6\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 2.0 літра до 3.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 201 к.с. до 335 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 8-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 11.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 7.8 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та елегантний стиль\n" +
                     "   - Чіткі лінії кузова та виразні LED фари\n" +
                     "   - Характерна решітка радіатора та динамічний профіль\n" +
                     "Інтер'єр:\n" +
                     "   - Високоякісні матеріали та деталі оздоблення\n" +
                     "   - Інноваційна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Комфортні сидіння з функцією обігріву та вентиляції\n" +
                     "Технології та безпека:\n" +
                     "   - Audi Virtual Cockpit та система навігації MMI Navigation Plus\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Система безпеки Audi Pre Sense та система розпізнавання пішоходів\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $55,000 до $75,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[8].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[8].Id).ToList()[2].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Сірий")).Id,
        price: 73000,
        displacement: 3.0d,
        description: "Марка та модель: Audi A6\n" +
                     "Класифікація: Седан / Універсал\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Дизельний\n" +
                     "   - Об'єм: Від 2.0 літра до 3.0 літра (залежно від комплектації)\n" +
                     "   - Потужність: Від 201 к.с. до 335 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: Від 7-ступінчастої до 8-ступінчастої (залежно від обраної трансмісії)\n" +
                     "Привід: Передній / Задній / Повний\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 6.5 л/100 км до 11.5 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.5 л/100 км до 7.8 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та елегантний стиль\n" +
                     "   - Чіткі лінії кузова та виразні LED фари\n" +
                     "   - Характерна решітка радіатора та динамічний профіль\n" +
                     "Інтер'єр:\n" +
                     "   - Високоякісні матеріали та деталі оздоблення\n" +
                     "   - Інноваційна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Комфортні сидіння з функцією обігріву та вентиляції\n" +
                     "Технології та безпека:\n" +
                     "   - Audi Virtual Cockpit та система навігації MMI Navigation Plus\n" +
                     "   - Адаптивний круїз-контроль та система автоматичного паркування\n" +
                     "   - Система безпеки Audi Pre Sense та система розпізнавання пішоходів\n" +
                     "Ємність багажника: Залежить від кузова та конфігурації\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $55,000 до $75,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[9].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[9].Id).ToList()[1].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Сірий")).Id,
        price: 27000,
        displacement: 2.5d,
        description: "Марка та модель: Hyundai Sonata\n" +
                     "Класифікація: Седан\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Гібридний\n" +
                     "   - Об'єм: Від 2.0 літра до 2.5 літра (залежно від комплектації та типу двигуна)\n" +
                     "   - Потужність: Від 191 к.с. до 290 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 8-ступінчаста (бензинова версія) / 6-ступінчаста (гібридна версія)\n" +
                     "Привід: Передній\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 5.7 л/100 км до 8.9 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.7 л/100 км до 6.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та динамічний стиль\n" +
                     "   - Чіткі лінії кузова та стильні LED фари\n" +
                     "   - Індивідуальний дизайн передньої частини та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Просторий та комфортний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Адаптивне регулювання сидінь та панель приладів з дисплеєм\n" +
                     "Технології та безпека:\n" +
                     "   - Hyundai SmartSense: Набір передових технологій безпеки, включаючи систему автоматичного екстреного гальмування та систему утримання смуги руху\n" +
                     "   - Система розпізнавання водія у стані підвищеної утомленості та система автоматичного паркування\n" +
                     "   - Динамічна система круїз-контролю та камера заднього виду\n" +
                     "Ємність багажника: Залежить від конфігурації та обсягу гібридної батареї\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $24,000 до $34,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[9].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[9].Id).ToList()[1].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Червоний")).Id,
        price: 26500,
        displacement: 2.0d,
        description: "Марка та модель: Hyundai Sonata\n" +
                     "Класифікація: Седан\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Гібридний\n" +
                     "   - Об'єм: Від 2.0 літра до 2.5 літра (залежно від комплектації та типу двигуна)\n" +
                     "   - Потужність: Від 191 к.с. до 290 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 8-ступінчаста (бензинова версія) / 6-ступінчаста (гібридна версія)\n" +
                     "Привід: Передній\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 5.7 л/100 км до 8.9 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.7 л/100 км до 6.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та динамічний стиль\n" +
                     "   - Чіткі лінії кузова та стильні LED фари\n" +
                     "   - Індивідуальний дизайн передньої частини та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Просторий та комфортний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Адаптивне регулювання сидінь та панель приладів з дисплеєм\n" +
                     "Технології та безпека:\n" +
                     "   - Hyundai SmartSense: Набір передових технологій безпеки, включаючи систему автоматичного екстреного гальмування та систему утримання смуги руху\n" +
                     "   - Система розпізнавання водія у стані підвищеної утомленості та система автоматичного паркування\n" +
                     "   - Динамічна система круїз-контролю та камера заднього виду\n" +
                     "Ємність багажника: Залежить від конфігурації та обсягу гібридної батареї\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $24,000 до $34,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    ),
        new VehicleDataModel(
        brandId: brands[9].Id,
        modelId: models.Where(x => x.VehicleBrandId == brands[9].Id).ToList()[1].Id,
        typeId: types.First(x => x.Name.Equals("Седан")).Id,
        colorId: colors.First(x => x.Name.Equals("Білий")).Id,
        price: 24000,
        displacement: 2.0d,
        description: "Марка та модель: Hyundai Sonata\n" +
                     "Класифікація: Седан\n" +
                     "Двигун:\n" +
                     "   - Тип: Бензиновий / Гібридний\n" +
                     "   - Об'єм: Від 2.0 літра до 2.5 літра (залежно від комплектації та типу двигуна)\n" +
                     "   - Потужність: Від 191 к.с. до 290 к.с. (залежно від обраного двигуна та модифікації)\n" +
                     "Трансмісія:\n" +
                     "   - Автоматична\n" +
                     "   - Кількість передач: 8-ступінчаста (бензинова версія) / 6-ступінчаста (гібридна версія)\n" +
                     "Привід: Передній\n" +
                     "Витрата пального:\n" +
                     "   - Місто: Від 5.7 л/100 км до 8.9 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "   - Автострада: Від 4.7 л/100 км до 6.1 л/100 км (залежно від обраного двигуна та приводу)\n" +
                     "Дизайн і екстер'єр:\n" +
                     "   - Сучасний та динамічний стиль\n" +
                     "   - Чіткі лінії кузова та стильні LED фари\n" +
                     "   - Індивідуальний дизайн передньої частини та характерна решітка радіатора\n" +
                     "Інтер'єр:\n" +
                     "   - Просторий та комфортний салон\n" +
                     "   - Сучасна інфотейнмент-система з сенсорним екраном та підтримкою Apple CarPlay/Android Auto\n" +
                     "   - Адаптивне регулювання сидінь та панель приладів з дисплеєм\n" +
                     "Технології та безпека:\n" +
                     "   - Hyundai SmartSense: Набір передових технологій безпеки, включаючи систему автоматичного екстреного гальмування та систему утримання смуги руху\n" +
                     "   - Система розпізнавання водія у стані підвищеної утомленості та система автоматичного паркування\n" +
                     "   - Динамічна система круїз-контролю та камера заднього виду\n" +
                     "Ємність багажника: Залежить від конфігурації та обсягу гібридної батареї\n" +
                     "Вартість (за орієнтованою конфігурацією): Від $24,000 до $34,000 (в залежності від обраної комплектації та додаткових опцій)\n"
    )
    ];
}